{
  "summary": "I am an incoming third-year student at the University of Toronto majoring in computer science and minoring in statistics and economics. Besides studying and coding, I love playing volleyball, attempting to cook, speedcubing, going on walks with my dog and playing piano. Oh, I'm also a huge board game addict, spending over $400 on board games this past year. My personal favorites are Catan, Quacks of Quedlinburg, One Night Ultimate Werewolf, and Codenames (although admittedtly I'm terrible at Codenames). I have also been trying to get back into chess after playing competitive chess from 5 years old to 10 years old. Feel free to get in contact with me with any of the platforms below!",
  "watchguard": "I'm currently a full stack software engineering intern at WatchGuard Technologies! I am working on DNSWatch which is a software that protects clients from phishing attacks. \nMy current contributions to DNS have included mocking functions and objects for the purpose of testing, refactoring Django templates to fix bugs in certain pages, as well as implmenting domain searching features.",
  "uoft": "Since January 2019, I have been an open source software developer, contributing to the development of Markus under Professor David Liu of the University of Toronto. Markus is a web application written in Ruby on Rails used by the University of Toronto as well as other universities for the submission and grading of student programming assignments.\n During this time, I have implemented brand new functionality for marking criterion, such that criterion based off of rubrics have an arbitrary number of levels, opposed to its previous five fixed levels. In the process of doing so, I created new models, generated database migrations, and wrote callbacks and validations to ensure that the criterion functionality work correctly. I have also used Ruby on Rails's single table inheritance feature to simplify the criterion database structure by consolidating multiple database tables into one.",
  "mitre": "During the summer of 2018, I worked as a software engineering intern for Mitre Corporation. Here, I helped develop Flux Notes, a web application written in React that helps clinicians collect oncology data. For the first half of this internship, I created an interactive table visualizer component that can view all labs/data collected at once. This table had features including highlighting data out of regular bounds, the ability to favorite certain labs/data such that favorited labs/data appear first, and saving the information in local storage. This table can be seen in fluxnotes.org/pilot1. My second task in my internship was implementing new features in the tablet scenario of Flux Notes to explore additional low burden approaches of capturing data. I implemented a button that when clicked, rendered the next patient and displayed their information on the page. I also implemented being able to view clinical notes through clicking keywords that related to structured data previously recorded by the clinician. These features can be viewed on fluxnotes.org/poc.\n During the summer of 2018, I also worked at Mitre Corporation as a software engineering intern. At this time, I worked with three other interns to create an airspace mapping web application with Javascript and Vue.js. I handled the user interface as well as the frontend logic to handle various user interactions."
}